src/InformationRegisters/Пайплайны/Пайплайны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Пайплайны</name>
  <resources>
    <name>Сборка</name>
    <type>
      <types>CatalogRef.Сборки</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПайплайнов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДобавленияВОчередь</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Лог</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерJob</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрлСостоянияJob</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдачныеТесты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеудачныеТесты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыПайплайнов/СтатусыПайплайнов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПайплайнов</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>ДобавленВОчередь</name>
  </enumValues>
  <enumValues>
    <name>ПрочитанОтчет</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/РаботаСJenkins/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СсылкаAllure(URLJenkins, ИмяJobJenkins, НомерJob) Экспорт
	
	Возврат СтрШаблон("%1/job/%2/%3/allure",
			URLJenkins,
			ИмяJobJenkins,
			НомерJob);
			
КонецФункции

Процедура ОбработатьСборки() Экспорт
	
	//todo описание структуры
	Пайплайны = РегистрыСведений.Пайплайны.АктивныеПайплайны();
	
	Для Каждого Пайплайн Из Пайплайны Цикл
		Если Пайплайн.Статус = Перечисления.СтатусыПайплайнов.Новый Тогда
			ЗапуститьПайплайн(Пайплайн);
		ИначеЕсли Пайплайн.Статус = Перечисления.СтатусыПайплайнов.ДобавленВОчередь Тогда
			ПроверитьСтартПайплайна(Пайплайн);
		ИначеЕсли Пайплайн.Статус = Перечисления.СтатусыПайплайнов.Выполняется Тогда
			ПроверитьВыполнениеПайплайна(Пайплайн);
		ИначеЕсли Пайплайн.Статус = Перечисления.СтатусыПайплайнов.Выполнено Тогда
			ПрочитатьОтчетПайплайна(Пайплайн);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗапуститьПайплайн(Пайплайн)

	ЗапускПриложенияЧерезJENKINS.ЗапускПриложенияПоЗадаче(Пайплайн);
	
КонецПроцедуры

Процедура ПроверитьВыполнениеПайплайна(Пайплайн)
	
	ЗапускПриложенияЧерезJENKINS.ПолучитьВыводПоСборке(Пайплайн);
	
КонецПроцедуры

Процедура ПроверитьСтартПайплайна(Пайплайн)
	
	ЗапускПриложенияЧерезJENKINS.ПроверитьСтартПайплайна(Пайплайн);
	
КонецПроцедуры

Процедура ПрочитатьОтчетПайплайна(Пайплайн)
	
	ЗапускПриложенияЧерезJENKINS.ПрочитатьОтчетПайплайнаAllure(Пайплайн);
	
КонецПроцедуры

#КонецОбласти
